Revit 2026 API

# ElementDesignOption Property

---

Returns the design option to which the element belongs.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DesignOption DesignOption { get; }
```
```vb
Public ReadOnly Property DesignOption As DesignOption
	Get
```
```cpp
public:
property DesignOption^ DesignOption {
	DesignOption^ get ();
}
```
```fsharp
member DesignOption : DesignOption with get
```

#### Property Value

DesignOption

If the element is not in a design option, i.e. in the main model, then this property will return .

#### Reference

Element Class

Autodesk.Revit.DB Namespace